13/data/attachments/4c45c0f1f3c41d39.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>James_program_Friend_40145_5</nif:username>
            <nif:friendToBeRequested>soap_friends_bdf95f31-4736-4629-b2cb-7d0a6725ca01</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>